In [1]:
#install pandas 
!pip install pandas

Requirement already satisfied: pandas in c:\users\ma986\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\ma986\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\ma986\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\ma986\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\ma986\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\ma986\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [2]:
import pandas as pd

In [3]:
import numpy as np

In [4]:
s1 = pd.Series([1,2,3,4,4,'4'])
s1

0    1
1    2
2    3
3    4
4    4
5    4
dtype: object

In [5]:
#changing index values
s2 = pd.Series([1,2,3,4,4,'4'] , index = [ 'a','b','c','d','e','f'])
s2

a    1
b    2
c    3
d    4
e    4
f    4
dtype: object

In [6]:
#coverting values intp float
s3 = pd.Series([1,2,3,4,4,'4'],index=['a','b','c','d','e','f'],dtype = float)
s3

a    1.0
b    2.0
c    3.0
d    4.0
e    4.0
f    4.0
dtype: float64

In [7]:
#dictionary using in the series
s4 = pd.Series({'A':12, 'B':22,'C':32,'D':42})
s4

A    12
B    22
C    32
D    42
dtype: int64

In [8]:
###  DATAFRAME
d1 = pd.DataFrame([1,2,3,4])
d1

   0
0  1
1  2
2  3
3  4

In [9]:
#converting series into dataframe
d2 = pd.DataFrame(s1)
d2

   0
0  1
1  2
2  3
3  4
4  4
5  4

In [10]:
#column index 
d3 = pd.DataFrame([[1,2,3],[2,3,4],[3,4,5]])
d3

   0  1  2
0  1  2  3
1  2  3  4
2  3  4  5

In [11]:
d4 = pd.DataFrame([[1,2,3],[2,3,4],[3,4,5]],columns = ['a','b','c'],index = ['x','y','z'])
d4

   a  b  c
x  1  2  3
y  2  3  4
z  3  4  5

In [12]:
#create data frame from list of dictionaries
dic = ({'alec':1,'george':2,},{'alec':1,'george':2,'mohan':3},{'alec':1,'george':2,'mohan':3,'marco':4})
l = pd.DataFrame(dic,index=['a','b','c'])
l

   alec  george  mohan  marco
a     1       2    NaN    NaN
b     1       2    3.0    NaN
c     1       2    3.0    4.0

In [13]:
##Dataframe operations
d4

   a  b  c
x  1  2  3
y  2  3  4
z  3  4  5

In [14]:
#printing a particular rows
print(d4['a'])
print(d4['b'])

x    1
y    2
z    3
Name: a, dtype: int64
x    2
y    3
z    4
Name: b, dtype: int64

In [15]:
#perform mathamatical operations
d4['d']=d4['a']+d4['c']
d4['e'] =d4['a']*d4['b']
d4

   a  b  c  d   e
x  1  2  3  4   2
y  2  3  4  6   6
z  3  4  5  8  12

In [16]:
#using a pop function
pop= d4.pop('b')
d4

   a  c  d   e
x  1  3  4   2
y  2  4  6   6
z  3  5  8  12

In [17]:
##insert function(loc,col name,data)
d4.insert(0 , 'New' , d4['c'])

In [18]:
d4

   New  a  c  d   e
x    3  1  3  4   2
y    4  2  4  6   6
z    5  3  5  8  12

In [53]:
###append operation(_append)
d = {'c':1,'cc':2,'ccc':4}
df11 = d4._append(d,ignore_index=True)
df11

   New    a  c    d     e   cc  ccc
0  3.0  1.0  3  4.0   2.0  NaN  NaN
1  4.0  2.0  4  6.0   6.0  NaN  NaN
2  5.0  3.0  5  8.0  12.0  NaN  NaN
3  NaN  NaN  1  NaN   NaN  2.0  4.0

In [54]:
import numpy as np
d5 =pd.DataFrame({'abc':np.random.randint(2,6,size = (10)),'bcd':np.random.randint(3,6,size=(10)),'cde':np.random.randint(4,10,size=(10))})
d5

   abc  bcd  cde
0    3    3    6
1    2    4    8
2    5    4    6
3    2    4    6
4    3    4    5
5    4    5    7
6    3    5    5
7    5    5    7
8    5    5    7
9    5    5    7

In [55]:
###head
d5.head()

   abc  bcd  cde
0    3    3    6
1    2    4    8
2    5    4    6
3    2    4    6
4    3    4    5

In [56]:
##tail
d5.tail()

   abc  bcd  cde
5    4    5    7
6    3    5    5
7    5    5    7
8    5    5    7
9    5    5    7

In [57]:
#information and describing
d5.info()
d5.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   abc     10 non-null     int32
 1   bcd     10 non-null     int32
 2   cde     10 non-null     int32
dtypes: int32(3)
memory usage: 252.0 bytes

             abc        bcd        cde
count  10.000000  10.000000  10.000000
mean    3.700000   4.400000   6.400000
std     1.251666   0.699206   0.966092
min     2.000000   3.000000   5.000000
25%     3.000000   4.000000   6.000000
50%     3.500000   4.500000   6.500000
75%     5.000000   5.000000   7.000000
max     5.000000   5.000000   8.000000

In [58]:
##loc (row name and column name)
d5.loc[1,'abc']

2

In [59]:
##row extraction
d5.loc[[2,3,4],['abc','bcd']]

   abc  bcd
2    5    4
3    2    4
4    3    4

In [60]:
##iloc 
d5.iloc[9,2]

7

In [61]:
##slicing in iloc
d5.iloc[1:8,[1,2]]

   bcd  cde
1    4    8
2    4    6
3    4    6
4    4    5
5    5    7
6    5    5
7    5    7

In [62]:
d5.iloc[1:5,[1,2]]

   bcd  cde
1    4    8
2    4    6
3    4    6
4    4    5

In [63]:
#print a certian column
d5.abc

0    3
1    2
2    5
3    2
4    3
5    4
6    3
7    5
8    5
9    5
Name: abc, dtype: int32

In [64]:
##print the column in array format
d5.abc.values

array([3, 2, 5, 2, 3, 4, 3, 5, 5, 5])

In [65]:
d5

   abc  bcd  cde
0    3    3    6
1    2    4    8
2    5    4    6
3    2    4    6
4    3    4    5
5    4    5    7
6    3    5    5
7    5    5    7
8    5    5    7
9    5    5    7

In [66]:
#using sub opearator
d5['sub'] = d5.abc.values-d5.bcd.values-d5.cde.values
d5

   abc  bcd  cde  sub
0    3    3    6   -6
1    2    4    8  -10
2    5    4    6   -5
3    2    4    6   -8
4    3    4    5   -6
5    4    5    7   -8
6    3    5    5   -7
7    5    5    7   -7
8    5    5    7   -7
9    5    5    7   -7

In [67]:
###employee salary
di = [['mohan',412,25000],['phani',515,30000],['hima',652,40000]]
df1 = pd.DataFrame(di,columns =['name','id','salary'])
df1

    name   id  salary
0  mohan  412   25000
1  phani  515   30000
2   hima  652   40000

In [68]:
####print the employee salary greater than 30000
y =df1[df1.salary>=30000]
print(y)
y[['id','salary']]

    name   id  salary
1  phani  515   30000
2   hima  652   40000

    id  salary
1  515   30000
2  652   40000

In [69]:
##using _append
l1 = df1._append({'name':'srinu','id':323,'salary':60000},ignore_index=True)
l1

    name   id  salary
0  mohan  412   25000
1  phani  515   30000
2   hima  652   40000
3  srinu  323   60000

In [70]:
l = l1[l1.salary<70000]
print(l)
l[['id','salary']]

    name   id  salary
0  mohan  412   25000
1  phani  515   30000
2   hima  652   40000
3  srinu  323   60000

    id  salary
0  412   25000
1  515   30000
2  652   40000
3  323   60000

In [71]:
##null values checking
l1.isnull()

    name     id  salary
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False

In [72]:
##show null values 
l1.isnull().sum()

name      0
id        0
salary    0
dtype: int64

In [44]:
###append operation(_append)
d = {'c':1,'cc':2,'ccc':4}
df11 = d4._append(d,ignore_index=True)
df11

   New    a  c    d     e   cc  ccc
0  3.0  1.0  3  4.0   2.0  NaN  NaN
1  4.0  2.0  4  6.0   6.0  NaN  NaN
2  5.0  3.0  5  8.0  12.0  NaN  NaN
3  NaN  NaN  1  NaN   NaN  2.0  4.0

In [73]:
df11

   New    a  c    d     e   cc  ccc
0  3.0  1.0  3  4.0   2.0  NaN  NaN
1  4.0  2.0  4  6.0   6.0  NaN  NaN
2  5.0  3.0  5  8.0  12.0  NaN  NaN
3  NaN  NaN  1  NaN   NaN  2.0  4.0

In [76]:
df11.isnull()

     New      a      c      d      e     cc    ccc
0  False  False  False  False  False   True   True
1  False  False  False  False  False   True   True
2  False  False  False  False  False   True   True
3   True   True  False   True   True  False  False

In [47]:
# df11.isnull().sum()

In [77]:
df11.dropna()

Empty DataFrame
Columns: [New, a, c, d, e, cc, ccc]
Index: []

In [74]:
###removing the null values
cleand_data = df11.dropna()
cleand_data

Empty DataFrame
Columns: [New, a, c, d, e, cc, ccc]
Index: []

In [75]:
df11

   New    a  c    d     e   cc  ccc
0  3.0  1.0  3  4.0   2.0  NaN  NaN
1  4.0  2.0  4  6.0   6.0  NaN  NaN
2  5.0  3.0  5  8.0  12.0  NaN  NaN
3  NaN  NaN  1  NaN   NaN  2.0  4.0

In [ ]:
d5.fillna(value = 'abc')

In [ ]:
df11.drop([2],axis = 0,inplace = True)
df11

In [ ]:
##Group By
df = pd.DataFrame({'birds':['falacon','sparrow','sparrow','falcon'],'Maxspeed':[100, 30,30,100],'windspeed':[120.0,342.0,435.0,333.0]})
df .groupby(['birds']).mean()

In [ ]:
df.T

In [ ]:
###get dummies operation
data = {'first_name':['mohan','latha','srinu','hima'],'last_name':['achari','latha','vasulu','bindhu'],'employementtype':['student','business','business','teacher'],'country':['india','usa','usa','australia']}
df=pd.DataFrame(data,columns= ['first_name','last_name','employementtype','country'])
print(df)

In [ ]:
df1 = pd.get_dummies(['employementtype'],dtype=int)
df2 = pd.get_dummies(['country'],dtype = int)
print(df1)
print(df2)

In [ ]:
### concatination concat()
frames = [df , df1 , df2]
result = pd.concat(frames,axis=0)
print(result)
result.drop(['employementtype','country'],axis = 1,inplace = True)
result

In [ ]:
result

In [ ]:
result.dropna()

In [ ]:
###india weather 
india_weather = pd.DataFrame({
    'cities':['mumbai','kolkatta','delhi','bihar'],'temperature':[30,40,25,50],'humidity':[80,60,70,40]})
india_weather

In [ ]:
### us weather
us_weather = pd.DataFrame({'cities':['newyork','chicago','orland'],'temperature':[20,30,22],'humidity':[40,45,60]})
us_weather

In [ ]:
#concatination of two weathers
df = pd.concat([india_weather,us_weather])
df

In [ ]:
##ignore index
df = pd.concat([india_weather,us_weather],ignore_index=True)
df

In [ ]:
####concatinating using keys
df = pd.concat([india_weather,us_weather],keys=['india','us'],ignore_index = True)
df

In [ ]:
##employees and those ages
emp = ({'name':['captian_america','thanos','hulk','thor','hulk'],'age':[60,80,50,90,50]})
info = pd.DataFrame(emp)
print(info)
print("------------------------------")
Info = info.drop_duplicates()
print(Info)

In [ ]:
#### Apply operations 
def cal_num (mohan):
    return mohan+1
data = { "x":[10,20,30], "y" : [30,40,50]}
df = pd.DataFrame(data)
print(df)
x = df.apply(cal_num)
print(x)

In [ ]:
###create a sample frame
data = {'name':['mohan','phani','hima','latha','srinu'],'gender':['male','female','female','female','male'],'age':[22,21,23,40,49]}
df1 = pd.DataFrame(data)
df1

In [ ]:
##categorical data
d = pd.Categorical(df1['gender'])
print(d)